Extensions/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb5f6678-4158-4ee5-8fcb-5d1c6c1cc651">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="458d6d7c-5c88-45b8-888f-4d270608a318">
    <name>ПересчитатьКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41d21375-fd54-4079-bbc2-300777a9d765">
    <name>ЯвляетсяНеРезидентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="847a0096-60ac-48f8-8aca-cbe9c6b9d831">
    <name>ВидВыдачиНДФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76824394-0205-4f78-811e-ec0d061e9082">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cb84cb-9e1e-453c-8713-90ca48083f56">
    <name>AzRyОрганизацияПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="97d34945-57be-4c10-8ebe-f99f645f7f21">
    <name>ТранспортныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4ba6fe2e-1665-4ebc-a9ca-2fc497fa8096">
      <name>ТранпсортноеСедство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="bdad0c95-0a6d-4755-a02b-e7b01def2cc9">
    <name>AzRyKYCАнкетаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="db6504ac-39b9-4ffe-b0cb-6e2ddd912856">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="969c130d-b763-4d98-b044-7238fd2376c3">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82020433-f8a7-4e23-b34a-13fe6dd56f97">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fa81535a-911f-42fb-92a8-88eb7a2103db">
    <name>AzRyОценкаРискаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f3b8cc7b-e7df-41a9-8a4a-c3d0ae1cae2b">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b5a4c161-918e-4341-ae1c-a9c60289f4b4">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b5f0385a-e18f-49ac-b01f-ac85c3a27a23">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="5ab7326e-1d26-42b8-84ec-ce160831942c">
    <name>AzRyРискМатрицаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7aeab778-b059-411e-8171-c588b1c39063">
      <name>ФакторРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e96ddf40-07c2-4d7b-a231-df498affa9ef">
      <name>ВероятностьРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4a3c4948-8048-429d-b0f9-ce88f0c2c947">
      <name>УровеньРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0ad8fa9-340f-4db3-a396-99b41e6da556">
      <name>МитигирующиеМеры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Extensions/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b6b4b04e-11e1-4863-abd0-935b3b246198">
  <name>ВидыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cbb74a99-a3de-4a04-b39c-0c5fdfc6a1b0">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1df639b-d0d6-4c5a-be9f-fe40514bb507">
    <name>ЮридическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="473e170d-f298-4de8-aa08-bb00f5100100">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="443de79e-3c1d-4498-b53e-77ce4b2a5167">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/AzRyДаНет/AzRyДаНет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0758b0ce-402d-4b1d-ba20-2cfe6f1cf2e5">
  <name>AzRyДаНет</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="81d9560d-cd4d-4100-a384-1bbd13b63839">
    <name>Да</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3fd4b7f9-65ef-4ed2-b334-ab320f092f55">
    <name>Нет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Catalogs/Контрагенты/Forms/AzRyФормаВводаДанныхКонтрагента/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ОрганизацияAzRyPay;

#КонецОбласти
				  
#Область СобытияФормы

// Обработчик события создания формы на сервере.
// Инициализирует реквизиты формы из параметров открытия,
// загружает контактную информацию и данные контактных лиц,
// обновляет элементы формы и добавляет пустую строку
// контактного лица, если таблица пуста.
//
// Параметры:
//  Отказ                - Булево           - Признак отказа от открытия формы.
//  СтандартнаяОбработка - Булево           - Признак стандартной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнаяОрганизация");
	
	Наименование = Параметры.ПараметрыОткрытия.Наименование;
	Компания     = Параметры.ПараметрыОткрытия.Компания;
	ИНН          = Параметры.ПараметрыОткрытия.ИНН;
	ДокументУдостоверяющийЛичность = Параметры.ПараметрыОткрытия.ДокументУдостоверяющийЛичность;
	
	ЗагрузитьДанныеКонтактныхЛицИзФормы(Параметры.ПараметрыОткрытия.ДанныеКонтактныхЛиц);
	ЗагрузитьКонтактнуюИнформацию(Параметры.ПараметрыОткрытия.КонтактнаяИнформация);
	
	ВидКонтрагента = Параметры.ПараметрыОткрытия.ВидКонтрагента;
	НалогообложениеНДС = Параметры.ПараметрыОткрытия.НалогообложениеНДС;
	
	ПрочитатьСвойстваВидовКонтактнойИнформацииКонтактныхЛиц();
	
	ОбновитьЭлементыКонтактныхЛиц();
	
	// УНФ.КонтактнаяИнформация
	КонтактнаяИнформацияУНФ.ПриСозданииПриЧтенииНаСервере(ЭтотОбъект);
	// Конец УНФ.КонтактнаяИнформация	
	
	// Всегда есть поля для заполнения одного контактного лица
	Если ДанныеКонтактныхЛиц.Количество() = 0 Тогда
		
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ЗаполнитьВсегдаВыводимыеВидыКИ(
		ДанныеКЛ.КонтактнаяИнформация,
		СвойстваВидовКонтактнойИнформацииКонтактныхЛиц);
		
	КонецЕсли;
	
	Элементы.Страница1.Видимость = Истина;
	Элементы.Страница2.Видимость = Ложь;
	Элементы.Страница3.Видимость = Ложь;
		
КонецПроцедуры

// Обработчик события открытия формы на клиенте.
// Обновляет видимость элементов в зависимости от текущих данных формы.
//
// Параметры:
//  Отказ - Булево - Признак отказа от открытия формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОрганизацияAzRyPay = ПолучитьОрганизациюAzRyPay();
	
	//ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента");
	//ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента");	
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДоступныеОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область КомандаОКИПроверкиЗаполнения

// Обработчик команды "OK". Собирает данные формы в структуру,
// выполняет проверки обязательных полей и закрывает форму с результатом.
//
// Параметры:
//  Команда - КомандаФормы - Команда, инициировавшая вызов процедуры.
//
&НаКлиенте
Процедура КомандаOK(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Компания", Компания);
	Результат.Вставить("ИНН", ИНН);
	Результат.Вставить("ДокументУдостоверяющийЛичность", ДокументУдостоверяющийЛичность);
	Результат.Вставить("КонтактнаяИнформация", ЭтотОбъект.КонтактнаяИнформация);
	Результат.Вставить("ДанныеКонтактныхЛиц", ЭтотОбъект.ДанныеКонтактныхЛиц);
	Результат.Вставить("ВидКонтрагента", ВидКонтрагента);
	Результат.Вставить("НалогообложениеНДС", НалогообложениеНДС);
	Результат.Вставить("AzRyKYCАнкетаКлиента", Объект.AzRyKYCАнкетаКлиента);
	Результат.Вставить("AzRyОценкаРискаКлиента", Объект.AzRyОценкаРискаКлиента);
	Результат.Вставить("AzRyРискМатрицаКлиента", Объект.AzRyРискМатрицаКлиента);
	Результат.Вставить("Организация", ЭтотОбъект.Организация);
	Результат.Вставить("ЭтоНовыйОбъект", Истина);
	Результат.Вставить("БанковскиСчет", Новый Структура("НомерСчета, БанкСчета, ВалютаСчета", ЭтотОбъект.НомерСчета, ЭтотОбъект.БанкСчета, ЭтотОбъект.ВалютаСчета));
		
	Если Не ПроверитьЗаполнениеОбязательныхПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеАдресаПоставки() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеКонтактныхЛиц() Тогда
		Возврат;
	КонецЕсли;

	Если Не ПроверитьБанковскиеСчета() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ПроверитьKYCОтветы() Тогда
		Возврат;
	КонецЕсли;	
	
	Закрыть(Новый Структура("ПоляДляЗаполнения", Результат));
	
КонецПроцедуры

// Проверяет заполнение обязательных полей формы:
// наименования или компании, ИНН, а также документа, удостоверяющего личность,
// если контрагент является физическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если все обязательные поля заполнены; Ложь в противном случае.
//
&НаКлиенте
Функция ПроверитьЗаполнениеОбязательныхПолей()
	
	Если (Не ЗначениеЗаполнено(Наименование) И Не ЗначениеЗаполнено(Компания))
		Или Не ЗначениеЗаполнено(ИНН)
		Или (ЭтоФизическоеЛицо() И Не ЗначениеЗаполнено(ДокументУдостоверяющийЛичность)) Тогда
		
		Сообщить("სავალდებულო ველების შევსება აუცილებელია", СтатусСообщения.Важное);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет заполнение адреса поставки в контактной информации формы.
// Перебирает строки таблицы контактной информации и проверяет наличие
// представления для строк с типом "Адрес".
//
// Возвращаемое значение:
//  Булево - Истина, если адрес поставки заполнен; Ложь в противном случае.
//
&НаКлиенте
Функция ПроверитьЗаполнениеАдресаПоставки()
	
	Для каждого ТекСтрока Из ЭтотОбъект.КонтактнаяИнформация Цикл	
		
		Если ТекСтрока.Тип = ЗначениеПеречисления("Адрес") Тогда		
			Если Не ЗначениеЗаполнено(ТекСтрока.Представление) Тогда		
				Сообщить("საქონლის მიწოდების ველის შევსება აუცილებელია. ", СтатусСообщения.Важное);
				Возврат Ложь;
			КонецЕсли; 				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Проверяет заполнение данных контактных лиц:
// наименования (имя и фамилия), адреса электронной почты и телефона
// для каждого контактного лица в таблице.
//
// Возвращаемое значение:
//  Булево - Истина, если все обязательные поля контактных лиц заполнены; Ложь в противном случае.
//
&НаКлиенте
Функция ПроверитьЗаполнениеКонтактныхЛиц()
	
	Для каждого ТекСтрока Из ЭтотОбъект.ДанныеКонтактныхЛиц Цикл	
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Наименование) Тогда
			
			Сообщить("საკონტაქტო პირის სახელის და გვარის ველის შევსება აუცილებელია. ", СтатусСообщения.Важное);
			Возврат Ложь;
			
		КонецЕсли; 
		
		Для каждого ТекЭл Из ТекСтрока.КонтактнаяИнформация Цикл
			
			Если ТекЭл.Тип = ЗначениеПеречисления("АдресЭлектроннойПочты") Тогда		
				Если Не ЗначениеЗаполнено(ТекЭл.Представление) Тогда		
					Сообщить("საკონტაქტო პირის ელ. მისამართის ველის შევსება აუცილებელია. ", СтатусСообщения.Важное);
					Возврат Ложь;				
				КонецЕсли; 				
			КонецЕсли;
			
			Если ТекЭл.Тип = ЗначениеПеречисления("Телефон") Тогда		
				Если Не ЗначениеЗаполнено(ТекЭл.Представление) Тогда		
					Сообщить("საკონტაქტო პირის ტელეფონის ველის შევსება აუცილებელია. ", СтатусСообщения.Важное);
					Возврат Ложь;				
				КонецЕсли; 				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Функция ПроверитьKYCОтветы()
	
	Для каждого ТекСтрока Из Объект.AzRyKYCАнкетаКлиента Цикл	
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Ответ) Тогда
			
			Сообщить("KYC პასუხების შევსება აუცილებელია.", СтатусСообщения.Важное);
			Возврат Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого ТекСтрока Из Объект.AzRyОценкаРискаКлиента Цикл	
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Ответ) Тогда
			
			Сообщить("KYC პასუხების შევსება აუცილებელია.", СтатусСообщения.Важное);
			Возврат Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Для каждого ТекСтрока Из Объект.AzRyРискМатрицаКлиента Цикл	
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ВероятностьРиска) Или Не ЗначениеЗаполнено(ТекСтрока.УровеньРиска) Или Не ЗначениеЗаполнено(ТекСтрока.МитигирующиеМеры) Тогда
			
			Сообщить("KYC პასუხების შევსება აუცილებელია.", СтатусСообщения.Важное);
			Возврат Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;	
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроверитьБанковскиеСчета()
			
	Если Не ЗначениеЗаполнено(НомерСчета) Или Не ЗначениеЗаполнено(БанкСчета) Или Не ЗначениеЗаполнено(ВалютаСчета)  Тогда
		
		Сообщить("საბანკო ანგარიშის მონაცემების შევსება აუცილებელია.", СтатусСообщения.Важное);
		Возврат Ложь;
		
	КонецЕсли; 	
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область УправлениеЭлементамиФормы

// Обновляет видимость элементов формы в зависимости от вида контрагента.
// Скрывает или показывает поле "ДокументУдостоверяющийЛичность"
// для физических лиц.
//
&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ДокументУдостоверяющийЛичность.Видимость = ЭтоФизическоеЛицо();	
	
	Если ОрганизацияAzRyPay = Организация Тогда
		Элементы.Страница2.Видимость = Истина;
		Элементы.Страница3.Видимость = Истина;
		Элементы.Страница4.Видимость = Истина;
		ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента", "Вопрос", "Ответ");
		ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента", "Вопрос", "Ответ");
		ЗаполнитьТаблицуВопросов("AzRyРискМатрицаКлиента", "AzRyФакторыРискаКлиента", "ФакторРиска");
	Иначе	
	    Элементы.Страница2.Видимость = Ложь;
		Элементы.Страница3.Видимость = Ложь;
		Элементы.Страница4.Видимость = Ложь;
		ОчиститьТаблицуВопросов("AzRyKYCАнкетаКлиента");
		ОчиститьТаблицуВопросов("AzRyОценкаРискаКлиента");
		ОчиститьТаблицуВопросов("AzRyРискМатрицаКлиента");
	КонецЕсли;	
	
КонецПроцедуры

// Определяет, является ли текущий контрагент физическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если вид контрагента равен "ФизическоеЛицо"; Ложь в противном случае.
//
&НаКлиенте
Функция ЭтоФизическоеЛицо()
	
	//Возврат Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	Возврат ЭтотОбъект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо");
	
КонецФункции

// Обработчик события изменения поля выбора вида контрагента (юр/физ лицо).
// Обновляет видимость элементов формы.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент формы, инициировавший событие.
//
&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область КонтактныеЛица

// Обработчик команды добавления нового контактного лица.
// Добавляет строку в таблицу данных контактных лиц,
// заполняет всегда выводимые виды контактной информации
// и обновляет элементы формы.
//
// Параметры:
//  Команда - КомандаФормы - Команда, инициировавшая вызов процедуры.
//
&НаКлиенте
Процедура ДобавитьПоляКонтактногоЛица(Команда)
	
	ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
	
	ЗаполнитьВсегдаВыводимыеВидыКИ(
	ДанныеКЛ.КонтактнаяИнформация,
	СвойстваВидовКонтактнойИнформацииКонтактныхЛиц);
	
	ОбновитьЭлементыКонтактныхЛиц();
	ТекущийЭлемент = Элементы["НаименованиеКонтакт_" + ДанныеКонтактныхЛиц.Индекс(ДанныеКЛ)];
	
КонецПроцедуры

// Динамически пересоздаёт элементы формы для отображения всех контактных лиц.
// Удаляет ранее добавленные динамические элементы, затем для каждого
// контактного лица создаёт группы и поля ввода (наименование, контактная информация,
// комментарий). Также обновляет списки выбора адресов.
//
&НаСервере
Процедура ОбновитьЭлементыКонтактныхЛиц()
	
	Элементы.Переместить(Элементы.ДобавитьПоляКонтактногоЛица, Элементы.КомандыДобавленияКонтакт_0);
	Элементы.КомандыДобавленияРастяжение_0.МаксимальнаяШирина = 41;
	
	УдаляемыеЭлементы = Новый Массив;
	// Группа первого контактного лица создана в конфигураторе
	Для ИндексГруппы = 1 По Элементы.ВсеКонтакты.ПодчиненныеЭлементы.Количество()-1 Цикл
		УдаляемыеЭлементы.Добавить(Элементы.ВсеКонтакты.ПодчиненныеЭлементы[ИндексГруппы]);
	КонецЦикла;
	Для Каждого ГруппаКИ Из Элементы.КонтактнаяИнформацияКонтакт_0.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ГруппаКИ);
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	ШиринаВидаКИ = 8;
	ШиринаПоляКомментария = 11;
	
	Для Каждого ДанныеКонтактногоЛица Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКонтакта = ДанныеКонтактныхЛиц.Индекс(ДанныеКонтактногоЛица);
		
		// Для первого контактного лица элементы формы созданы в конфигураторе
		Если ИндексКонтакта > 0 Тогда
			
			ГруппаКонтактногоЛица = Элементы.Добавить("Контакт_" + ИндексКонтакта, Тип("ГруппаФормы"), Элементы.ВсеКонтакты);
			ГруппаКонтактногоЛица.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКонтактногоЛица.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКонтактногоЛица.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаКонтактногоЛица.ОтображатьЗаголовок = Ложь;
			
			ПолеНаименование = Элементы.Добавить("НаименованиеКонтакт_" + ИндексКонтакта, Тип("ПолеФормы"), ГруппаКонтактногоЛица);
			ПолеНаименование.Вид = ВидПоляФормы.ПолеВвода;
			ПолеНаименование.ПутьКДанным = "ДанныеКонтактныхЛиц[" + ИндексКонтакта + "].Наименование";
			ПолеНаименование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеНаименование.ПодсказкаВвода = НСтр("ka='სახელი გვარი';ru='Имя Фамилия';en='First Name Last Name'");
			ПолеНаименование.АвтоМаксимальнаяШирина = Ложь;
			ПолеНаименование.МаксимальнаяШирина = 52;
			
			ПолеНаименование.УстановитьДействие("АвтоПодбор", "НаименованиеКонтакт_АвтоПодбор");
			ПолеНаименование.УстановитьДействие("ОбработкаВыбора", "НаименованиеКонтакт_ОбработкаВыбора");
			
			ГруппаКИ = Элементы.Добавить("КонтактнаяИнформацияКонтакт_" + ИндексКонтакта, Тип("ГруппаФормы"), ГруппаКонтактногоЛица);
			ГруппаКИ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКИ.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаКИ.ОтображатьЗаголовок = Ложь;
			
			ГруппаДобавление = Элементы.Добавить("КомандыДобавленияКонтакт_" + ИндексКонтакта, Тип("ГруппаФормы"), ГруппаКонтактногоЛица);
			ГруппаДобавление.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДобавление.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаДобавление.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаДобавление.ОтображатьЗаголовок = Ложь;
			
			ДекорацияРастяжение = Элементы.Добавить("КомандыДобавленияРастяжение_" + ИндексКонтакта, Тип("ДекорацияФормы"), ГруппаДобавление);
			ДекорацияРастяжение.Вид = ВидДекорацииФормы.Надпись;
			ДекорацияРастяжение.АвтоМаксимальнаяШирина = Ложь;
			ДекорацияРастяжение.МаксимальнаяШирина = 41;
			ДекорацияРастяжение.РастягиватьПоГоризонтали = Истина;
			
			Кнопка = Элементы.Добавить("ДобавитьПолеКонтактнойИнформацииКонтактногоЛица_" + ИндексКонтакта, Тип("КнопкаФормы"), ГруппаДобавление);
			Кнопка.ИмяКоманды = "ДобавитьПолеКонтактнойИнформацииКонтактногоЛица";
			Кнопка.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
			Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
			
		Иначе
			
			ГруппаКИ = Элементы.КонтактнаяИнформацияКонтакт_0;
			
		КонецЕсли;
		
		Отбор = Новый Структура("Вид");
		
		Для Каждого ДанныеКИ Из ДанныеКонтактногоЛица.КонтактнаяИнформация Цикл
			
			ИндексКИ = ДанныеКонтактногоЛица.КонтактнаяИнформация.Индекс(ДанныеКИ);
			Отбор.Вид = ДанныеКИ.Вид;
			НайденныеСтроки = СвойстваВидовКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СвойстваВида = НайденныеСтроки[0];
			
			ГруппаЗначениеКИ = Элементы.Добавить("Контакт_" + ИндексКонтакта + "_КИ_" + ИндексКИ, Тип("ГруппаФормы"), ГруппаКИ);
			ГруппаЗначениеКИ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЗначениеКИ.Заголовок = ДанныеКИ.Вид;
			ГруппаЗначениеКИ.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаЗначениеКИ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаЗначениеКИ.ОтображатьЗаголовок = Ложь;
			
			ДекорацияДействие = Элементы.Добавить("ДействиеКонтакт_" + ИндексКонтакта + "_КИ_" + ИндексКИ, Тип("ДекорацияФормы"), ГруппаЗначениеКИ);
			ДекорацияДействие.Вид = ВидДекорацииФормы.Картинка;
			ДекорацияДействие.Картинка = КонтактнаяИнформацияУНФ.КартинкаДействияПоТипуКонтактнойИнформации(ДанныеКИ.Тип);
			ДекорацияДействие.Гиперссылка = Истина;
			ДекорацияДействие.Ширина = 2;
			ДекорацияДействие.Высота = 1;
			ДекорацияДействие.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			ДекорацияДействие.УстановитьДействие("Нажатие", "Подключаемый_ДействиеКИКонтактаНажатие");
			
			ПолеВид = Элементы.Добавить("ВидКонтакт_" + ИндексКонтакта + "_КИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
			ПолеВид.Вид = ВидПоляФормы.ПолеНадписи;
			ПолеВид.ПутьКДанным = "ДанныеКонтактныхЛиц[" + ИндексКонтакта + "].КонтактнаяИнформация[" + ИндексКИ + "].Вид";
			ПолеВид.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеВид.Ширина = ШиринаВидаКИ;
			ПолеВид.РастягиватьПоГоризонтали = Ложь;
			
			ДоступноРедактированиеВДиалоге = КонтактнаяИнформацияУНФ.ДляТипаКонтактнойИнформацииДоступноРедактированиеВДиалоге(ДанныеКИ.Тип);
			
			ПолеПредставление = Элементы.Добавить("ПредставлениеКонтакт_" + ИндексКонтакта + "_КИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
			ПолеПредставление.Вид = ВидПоляФормы.ПолеВвода;
			ПолеПредставление.ПутьКДанным = "ДанныеКонтактныхЛиц[" + ИндексКонтакта + "].КонтактнаяИнформация[" + ИндексКИ + "].Представление";
			ПолеПредставление.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			ПолеПредставление.КнопкаВыбора = ДоступноРедактированиеВДиалоге;
			ПолеПредставление.АвтоОтметкаНезаполненного = СвойстваВида.ОбязательноеЗаполнение;
			ПолеПредставление.ШиринаВыпадающегоСписка = 40;
			ПолеПредставление.УстановитьДействие("ПриИзменении", "Подключаемый_ПредставлениеКИКонтактаПриИзменении");
			ПолеПредставление.УстановитьДействие("Очистка", "Подключаемый_ПредставлениеКИКонтактаОчистка");
			Если СвойстваВида.РедактированиеТолькоВДиалоге Тогда
				ПолеПредставление.РедактированиеТекста = Ложь;
				ПолеПредставление.ЦветФона = ЦветаСтиля.КонтактнаяИнформацияСРедактированиемВДиалогеЦвет;
			КонецЕсли;
			Если ДоступноРедактированиеВДиалоге Тогда
				ПолеПредставление.УстановитьДействие("НачалоВыбора", "Подключаемый_ПредставлениеКИКонтактаНачалоВыбора");
			КонецЕсли;
			Если ДанныеКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
				ПолеПредставление.МногострочныйРежим = Истина;
				ПолеПредставление.Высота = 2;
				ПолеПредставление.РастягиватьПоВертикали = Ложь;
			КонецЕсли;
			
			Если КонтактнаяИнформацияУНФ.ДляТипаКонтактнойИнформацииДоступенВводКомментария(ДанныеКИ.Тип) Тогда
				
				ПолеПредставление.АвтоМаксимальнаяШирина = Ложь;
				ПолеПредставление.МаксимальнаяШирина = 27;
				
				ПолеКомментарий = Элементы.Добавить("КомментарийКонтакт_" + ИндексКонтакта + "_КИ_" + ИндексКИ, Тип("ПолеФормы"), ГруппаЗначениеКИ);
				ПолеКомментарий.Вид = ВидПоляФормы.ПолеВвода;
				ПолеКомментарий.ПутьКДанным = "ДанныеКонтактныхЛиц[" + ИндексКонтакта + "].КонтактнаяИнформация[" + ИндексКИ + "].Комментарий";
				ПолеКомментарий.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеКомментарий.ПропускатьПриВводе = Истина;
				ПолеКомментарий.ПодсказкаВвода = НСтр("ka='შენიშვ.';ru='Прим.';en='Approx.'");
				ПолеКомментарий.АвтоМаксимальнаяШирина = Ложь;
				ПолеКомментарий.МаксимальнаяШирина = ШиринаПоляКомментария;
				ПолеКомментарий.УстановитьДействие("ПриИзменении", "Подключаемый_КомментарийКИКонтактаПриИзменении");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаполнитьСписокВыбораАдресовКонтактныхЛиц(ЭтотОбъект);
	
	ИндексПоследнегоКЛ = ДанныеКонтактныхЛиц.Количество()-1;
	КомандаДобавленияКИ = Элементы["ДобавитьПолеКонтактнойИнформацииКонтактногоЛица_" + ИндексПоследнегоКЛ];
	Элементы.Переместить(Элементы.ДобавитьПоляКонтактногоЛица, КомандаДобавленияКИ.Родитель, КомандаДобавленияКИ);
	Элементы["КомандыДобавленияРастяжение_" + ИндексПоследнегоКЛ].МаксимальнаяШирина = 34;
	
КонецПроцедуры

// Заполняет список выбора адресов для всех полей контактной информации
// типа "Адрес" во всех контактных лицах формы. Список формируется из
// уже введённых непустых значений адресов (без дублей).
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, содержащая таблицы данных контактных лиц
//                             и свойств видов контактной информации.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораАдресовКонтактныхЛиц(Форма) Экспорт
	
	МассивАдресов = Новый Массив;
	Отбор = Новый Структура("Вид");
	
	Для Каждого ДанныеКонтактногоЛица Из Форма.ДанныеКонтактныхЛиц Цикл
		Для Каждого СтрокаТаблицы Из ДанныеКонтактногоЛица.КонтактнаяИнформация Цикл
			
			Если СтрокаТаблицы.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор.Вид = СтрокаТаблицы.Вид;
			НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаТаблицы.Представление)
				И МассивАдресов.Найти(СтрокаТаблицы.Представление) = Неопределено Тогда
				
				МассивАдресов.Добавить(СтрокаТаблицы.Представление);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ДанныеКонтактногоЛица Из Форма.ДанныеКонтактныхЛиц Цикл
		Для Каждого СтрокаТаблицы Из ДанныеКонтактногоЛица.КонтактнаяИнформация Цикл
			
			Если СтрокаТаблицы.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор.Вид = СтрокаТаблицы.Вид;
			НайденныеСтроки = Форма.СвойстваВидовКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПоля = "ПредставлениеКонтакт_" + Форма.ДанныеКонтактныхЛиц.Индекс(ДанныеКонтактногоЛица) + "_КИ_" + ДанныеКонтактногоЛица.КонтактнаяИнформация.Индекс(СтрокаТаблицы);
			ПолеПредставление = Форма.Элементы[ИмяПоля];
			ПолеПредставление.СписокВыбора.ЗагрузитьЗначения(МассивАдресов);
			
			ПолеПредставление.КнопкаВыпадающегоСписка = ПолеПредставление.СписокВыбора.Количество() > 0;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик команды добавления нового поля контактной информации
// для контактного лица. Определяет индекс контакта из имени текущего элемента,
// формирует список доступных для добавления видов КИ
// и отображает пользователю список для выбора.
//
// Параметры:
//  Команда - КомандаФормы - Команда, инициировавшая вызов процедуры.
//
&НаКлиенте
Процедура ДобавитьПолеКонтактнойИнформацииКонтактногоЛица(Команда)
	
	ИндексКонтакта = Число(Сред(ТекущийЭлемент.Имя, СтрДлина("ДобавитьПолеКонтактнойИнформацииКонтактногоЛица_")+1));
	ДанныеКонтакта = ДанныеКонтактныхЛиц[ИндексКонтакта];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндексКонтакта", ИндексКонтакта);
	ДополнительныеПараметры.Вставить("МножественнаяФормаВладельца", НСтр("ka='საკონტაქტო პირები';ru='контактных лиц';en='contact persons'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКонтактнуюИнформациюКонтактаВидВыбран", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокДоступныхВидов = Новый СписокЗначений;
	Отбор = Новый Структура("Вид");
	Для Каждого СтрокаТаблицы Из СвойстваВидовКонтактнойИнформацииКонтактныхЛиц Цикл
		Отбор.Вид = СтрокаТаблицы.Вид;
		Если СтрокаТаблицы.РазрешитьВводНесколькихЗначений Или ДанныеКонтакта.КонтактнаяИнформация.НайтиСтроки(Отбор).Количество() = 0 Тогда
			СписокДоступныхВидов.Добавить(СтрокаТаблицы.Вид, СтрокаТаблицы.ПредставлениеВида);
		КонецЕсли;
	КонецЦикла;
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокДоступныхВидов, ТекущийЭлемент);
	
КонецПроцедуры

// Заполняет таблицу контактной информации строками для видов КИ,
// которые должны всегда отображаться в форме (ВыводитьВФормеВсегда = Истина).
//
// Параметры:
//  КИ                                              - КоллекцияСтрокТаблицыФормы - Таблица
//                                                    контактной информации контактного лица.
//  СвойстваВидовКонтактнойИнформацииКонтактныхЛиц - ТаблицаЗначений           - Таблица
//                                                    свойств видов контактной информации.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВсегдаВыводимыеВидыКИ(КИ, СвойстваВидовКонтактнойИнформацииКонтактныхЛиц)
	
	НайденныеСтроки = СвойстваВидовКонтактнойИнформацииКонтактныхЛиц.НайтиСтроки(Новый Структура("ВыводитьВФормеВсегда", Истина));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		НоваяСтрокаКИ = КИ.Добавить();
		НоваяСтрокаКИ.Вид = НайденнаяСтрока.Вид;
		НоваяСтрокаКИ.Тип = НайденнаяСтрока.Тип;
		
	КонецЦикла;
	
КонецПроцедуры

// Читает свойства видов контактной информации для контактных лиц
// из справочника "ВидыКонтактнойИнформации" и регистра сведений
// "НастройкиВидовКонтактнойИнформации". Результат загружается
// в реквизит формы "СвойстваВидовКонтактнойИнформацииКонтактныхЛиц".
//
&НаСервере
Процедура ПрочитатьСвойстваВидовКонтактнойИнформацииКонтактныхЛиц()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПорядокТиповКИ.Тип,
	|	ПорядокТиповКИ.Порядок
	|ПОМЕСТИТЬ втПорядокТипов
	|ИЗ
	|	&ПорядокТиповКИ КАК ПорядокТиповКИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	ПРЕДСТАВЛЕНИЕ(ВидыКонтактнойИнформации.Ссылка) КАК ПредставлениеВида,
	|	ВидыКонтактнойИнформации.Тип КАК Тип,
	|	ЕСТЬNULL(НастройкиВидовКонтактнойИнформации.ВыводитьВФормеВсегда, ЛОЖЬ) КАК ВыводитьВФормеВсегда,
	|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений КАК РазрешитьВводНесколькихЗначений,
	|	ВидыКонтактнойИнформации.ОбязательноеЗаполнение,
	|	ВидыКонтактнойИнформации.ПроверятьКорректность,
	|	ВидыКонтактнойИнформации.РедактированиеТолькоВДиалоге
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПорядокТипов КАК втПорядокТипов
	|		ПО ВидыКонтактнойИнформации.Тип = втПорядокТипов.Тип
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВидовКонтактнойИнформации КАК НастройкиВидовКонтактнойИнформации
	|		ПО ВидыКонтактнойИнформации.Ссылка = НастройкиВидовКонтактнойИнформации.Вид
	|ГДЕ
	|	ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПорядокТипов.Порядок,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания");
	
	Запрос.УстановитьПараметр("ПорядокТиповКИ", КонтактнаяИнформацияУНФ.ПорядокТиповКИ());
	Запрос.УстановитьПараметр("ГруппаВидовКИ", Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	СвойстваВидовКонтактнойИнформацииКонтактныхЛиц.Загрузить(ТаблицаСвойств);
	
КонецПроцедуры

// Загружает данные контактных лиц из коллекции данных формы
// в реквизит формы "ДанныеКонтактныхЛиц".
// Для каждой строки переносит контактное лицо, наименование
// и контактную информацию.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Коллекция данных формы
//                         с данными контактных лиц.
//
&НаСервере
Процедура ЗагрузитьДанныеКонтактныхЛицИзФормы(ДанныеФормыКоллекция)
	
	ТЗ = ДанныеФормыВЗначение(ДанныеФормыКоллекция, Тип("ТаблицаЗначений"));
	Для каждого ТекСтрока Из ТЗ Цикл
		
		НоваяСтрока = ДанныеКонтактныхЛиц.Добавить();
		НоваяСтрока.КонтактноеЛицо = ТекСтрока.КонтактноеЛицо;
		НоваяСтрока.Наименование = ТекСтрока.Наименование;
		НоваяСтрока.КонтактнаяИнформация.Загрузить(ТекСтрока.КонтактнаяИнформация);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КонтактнаяИнформация

// Выгружает таблицу контактной информации формы в таблицу значений.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с данными контактной информации.
//
&НаСервере
Функция КонтактнаяИнформацияТЗ()
	
	Возврат ЭтотОбъект.КонтактнаяИнформация.Выгрузить();
	
КонецФункции

// Загружает контактную информацию из коллекции данных формы в табличную часть объекта.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Коллекция данных формы
//                         с контактной информацией.
//
&НаСервере
Процедура ЗагрузитьКонтактнуюИнформацию(ДанныеФормыКоллекция)
	
	ТЗ = ДанныеФормыВЗначение(ДанныеФормыКоллекция, Тип("ТаблицаЗначений"));
	Объект.КонтактнаяИнформация.Загрузить(ТЗ);
	
КонецПроцедуры

// Добавляет или обновляет строку юридического адреса контрагента
// в таблице контактной информации формы.
// Если строка с видом "ЮрАдресКонтрагента" уже существует — обновляет её,
// иначе добавляет новую строку.
//
// Параметры:
//  ЮридическийАдресКонтрагента - Строка - Текстовое представление юридического адреса.
//
&НаСервере
Процедура ДобавитьЮридическийАдресКонтрагента(ЮридическийАдресКонтрагента)
	
	ТЗ = ЭтотОбъект.КонтактнаяИнформация.Выгрузить();
	
	СтруктураПараметров = Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	СтрокаКИ = ТЗ.НайтиСтроки(СтруктураПараметров);
	Если СтрокаКИ.Количество() = 0 Тогда
		СтрокаКИ = ТЗ.Добавить();
		СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	Иначе
		СтрокаКИ = СтрокаКИ[0];
	КонецЕсли;
	
	//СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	СтрокаКИ.Представление = ЮридическийАдресКонтрагента;
	СтрокаКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлениюГрузия(СтрокаКИ.Представление);
	
	ЭтотОбъект.КонтактнаяИнформация.Загрузить(ТЗ);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияСRS

// Обработчик команды получения информации о контрагенте из сервиса RS
// по заполненному ИНН. Выполняет серверный вызов и обновляет элементы формы.
//
// Параметры:
//  Команда - КомандаФормы - Команда, инициировавшая вызов процедуры.
//
&НаКлиенте
Процедура ПолучитьИнфоИзRS(Команда)
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='გსნ არ არის შევსებული';ru='ИНН не заполнено.';en='VAT is not filled.'"));
		Возврат;
	КонецЕсли;
	
	ПолучитьИнфоИзRSСервер();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

// Получает данные контрагента из сервиса RS по ИНН и заполняет реквизиты формы:
// наименование, вид контрагента, налогообложение НДС и юридический адрес.
// Выполняет два запроса к сервису: основной и расширенный (для получения статуса НДС).
//
&НаСервере
Процедура ПолучитьИнфоИзRSСервер()
	
	ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервере(ИНН);
	
	Если ДанныеКонтрагента = Неопределено Или ДанныеКонтрагента.Статус = ""  Тогда
		Сообщить(НСтр("ka='კონტრაგენტი მიმდინარე გსნ-თ ვერ მოიძებნა RS-ზე';ru='Контрагент с данным ИНН не найден на RS.';en='Counterparty with the INN is not found in the RS.'"));
		Возврат;
	КонецЕсли;	
	
	Наименование = ДанныеКонтрагента.Имя;
	Компания     = ДанныеКонтрагента.Имя;
	
	Если ДанныеКонтрагента.ТипОрганизаций = "ფიზიკური პირი" Тогда
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "შ\პ\ს" ИЛИ ДанныеКонтрагента.ТипОрганизаций = "სააქციო საზოგადოება" ИЛИ ДанныеКонтрагента.ТипОрганизаций = "საჯარო სამართლის იურიდიული პირი" Тогда	
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "სახელმწიფო ორგანოები" Тогда	
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "ინდივიდუალური მეწარმე" Тогда	
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
	Иначе
		ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	КонецЕсли;	
	
	// Юридический адрес	
	ДобавитьЮридическийАдресКонтрагента(ДанныеКонтрагента.Адрес);
	
	ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервереНов(ИНН);
	
	Если ДанныеКонтрагента = Неопределено Или ДанныеКонтрагента.UnID = 0  Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДанныеКонтрагента.IsVatPayer Тогда
		Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
		КонецЕсли;			
	Иначе 
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеФункции

// Возвращает предопределённое значение перечисления "ТипыКонтактнойИнформации"
// по переданному имени значения.
//
// Параметры:
//  Имя - Строка - Имя значения перечисления (например, "Адрес", "Телефон").
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыКонтактнойИнформации - Ссылка на значение перечисления.
//
&НаКлиенте
Функция ЗначениеПеречисления(Имя)
	
	//Возврат Перечисления.ТипыКонтактнойИнформации[Имя];	   
	Возврат ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации."+Имя);
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеОрганизации()
	
	Ответ = Новый СписокЗначений;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	AzRyНастройкаРЛСОрганизации.Организация КАК Организация
		|ИЗ
		|	Справочник.AzRyНастройкаРЛС.Организации КАК AzRyНастройкаРЛСОрганизации
		|ГДЕ
		|	НЕ AzRyНастройкаРЛСОрганизации.Ссылка.ПометкаУдаления
		|	И AzRyНастройкаРЛСОрганизации.Ссылка.Пользователь = &Пользователь";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизациюAzRyPay()

	Возврат Константы.AzRyОрганизацияAzRyPay.Получить();	

КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуВопросов(ИмяТабличнойЧасти, ПеречислениеВопросовТекст, Колонка, КолонкаОтвет = Неопределено)
	
	Ответ = ПолучитьСоответствиеВопросовKYC();
	
	ПеречислениеВопросов = Перечисления[ПеречислениеВопросовТекст];
	
	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];
	
	Для Каждого Вопрос Из ПеречислениеВопросов Цикл
		
		Если Не ВопросУжеЕсть(ТаблицаВопросов, Вопрос, Колонка) Тогда
			НоваяСтрока = ТаблицаВопросов.Добавить();
			НоваяСтрока[Колонка] = Вопрос;
			Если КолонкаОтвет = Неопределено Тогда
				Для каждого ТекСтрока Из Ответ[ПеречислениеВопросовТекст][Вопрос] Цикл
				
					НоваяСтрока[ТекСтрока.Ключ] = ТекСтрока.Значение; 
					
				КонецЦикла;	
			Иначе 	
				НоваяСтрока[КолонкаОтвет] = Ответ[ПеречислениеВопросовТекст][Вопрос];
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуВопросов(ИмяТабличнойЧасти)
		
	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];
	ТаблицаВопросов.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ВопросУжеЕсть(Таблица, Вопрос, Колонка)

	Для Каждого Стр Из Таблица Цикл
		
		Если Стр[Колонка] = Вопрос Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаСервере
// Возвращает соответствие: Ключ = Значение перечисления, Значение = начальное значение ответа
Функция ПолучитьСоответствиеВопросовKYC() Экспорт
	
	СоотвВопросыKYCАнкетыКлиента = Новый Соответствие;
	СоотвKYCВопросыКлиента       = Новый Соответствие;
	СоотвФакторыРискаКлиента     = Новый Соответствие;
	
	Ответ = Новый Структура("AzRyВопросыKYCАнкетыКлиента, AzRyKYCВопросыКлиента, AzRyФакторыРискаКлиента", СоотвВопросыKYCАнкетыКлиента, СоотвKYCВопросыКлиента, СоотвФакторыРискаКлиента);
	
	// Вопросы анкеты KYC клиента
    П = Перечисления.AzRyВопросыKYCАнкетыКлиента;
	
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ВидДеятельностиКлиента,                       "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ЦельУстановленияДеловыхОтношений,             "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СтраныОсуществленияДеятельности,              "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ИсточникПроисхожденияСредств,                 "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ПредполагаемыйГодовойОборот,                  "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ДействуетЛиВИнтересахБенефициарногоВладельца, "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СведенияОТретьемЛицеИБенефициаре,             "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.ПризнакPEP,             					  "");
	СоотвВопросыKYCАнкетыКлиента.Вставить(П.СведенияОPEP,             					  "");
	
	// Вопросы KYC анкеты клиента 2
    П = Перечисления.AzRyKYCВопросыКлиента;
	
    СоотвKYCВопросыКлиента.Вставить(П.ОписаниеДоговораОбслуживания,             "");
    СоотвKYCВопросыКлиента.Вставить(П.ОжидаемаяСтоимостьОперацийБолее3000,    Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакКомплексныхОпераций,             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакНеобычногоПоведенияКлиента,      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакPEP,                             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СложнаяСтруктураСобственности,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ПризнакВысокогоДоходаКлиента,           Перечисления.AzRyДаНет.ПустаяСсылка());
	
	СоотвKYCВопросыКлиента.Вставить(П.ДеятельностьСвязанаСОружиемИлиБоеприпасами,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ТорговляПроизведениямиИскусстваИлиПредметамиРоскоши, Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОперацииСДрагоценнымиМеталлами,                      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОперацииСНефтьюИГазом,                               Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СтроительствоИЛиНедвижимость,                        Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ВалютныеОперацииИФорекс,                             Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.КриптовалютнаяДеятельность,                          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ФинансовоеПосредничество,                            Перечисления.AzRyДаНет.ПустаяСсылка());
	СоотвKYCВопросыКлиента.Вставить(П.ИгровойБизнес,                                       Перечисления.AzRyДаНет.ПустаяСсылка());
	
    СоотвKYCВопросыКлиента.Вставить(П.СвязьСВысокорисковойСтраной,            Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОффшорнаяРегистрация,                   Перечисления.AzRyДаНет.ПустаяСсылка());
	
    СоотвKYCВопросыКлиента.Вставить(П.АудитНедвижимостьСделки,          Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.АудитБизнесСделки,                Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.СозданиеИУправлениеЮрЛицами,      Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ДистанционноеОбслуживаниеКлиента, Перечисления.AzRyДаНет.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ИныеФакторыРискаКлиента,          "");
    СоотвKYCВопросыКлиента.Вставить(П.УровеньРискаКлиента,              Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка());
    СоотвKYCВопросыКлиента.Вставить(П.ОписаниеФакторовРискаКлиента,     "");
	
	// Факторы риска клиента
    П = Перечисления.AzRyФакторыРискаКлиента;
	
    СоотвФакторыРискаКлиента.Вставить(П.СтабильныйИЛиЗнакомыйКлиент,       
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры", 
					Перечисления.AzRyДаНет.ПустаяСсылка(), 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 	
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));
	
	СоотвФакторыРискаКлиента.Вставить(П.БезналичныеРасчетыЧерезВендинг,    
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры", 
					Перечисления.AzRyДаНет.ПустаяСсылка(), 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));
	
	СоотвФакторыРискаКлиента.Вставить(П.ЛимитСуммыОпераций,                
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры", 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));
	
	СоотвФакторыРискаКлиента.Вставить(П.НаличиеИностранногоЭлемента,    
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры", 
					Перечисления.AzRyДаНет.ПустаяСсылка(), 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));
	
	СоотвФакторыРискаКлиента.Вставить(П.ОтсутствиеСвязиСВысокорисковымиЮрисдикциями,  
	Новый Структура("ВероятностьРиска, УровеньРиска, МитигирующиеМеры", 
					Перечисления.AzRyДаНет.ПустаяСсылка(), 
					Перечисления.AzRyУровеньРискаКлиента.ПустаяСсылка(), 
					Перечисления.AzRyМитигирующиеМерыРиска.ПустаяСсылка()));
	
    Возврат Ответ;
    
КонецФункции 

#КонецОбласти
